W7D4_pokedex/jbuilder/app/views/api/parties/show.json.jbuilder

SELECT "guests".* FROM "guests" INNER JOIN "invitations" ON "guests"."id" = "invitations"."guest_id" WHERE "invitations"."party_id" = $1  [["party_id", 1]]
---
json.guests do
  json.array! @party.guests.each do |guest|