W5D3_reddit_clone/W5D3_redit_clone/app/controllers/application_controller.rb

  def current_user
    User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "fUW2IcDCebu4kGrkvafBpg"], ["LIMIT", 1]]