W5D3_reddit_clone/W5D3_redit_clone/app/controllers/posts_controller.rb

  def create
    params[:post][:subreddit_ids].map! { |el| el.to_i }
    params[:post][:subreddit_ids] = params[:post][:subreddit_ids].drop(1)
    @post = Post.new(post_params)
    @post.user = current_user
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @post = current_user.posts.find(params[:id])
    if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "Sallem loves cats even though they don't always luv him!!!1"], ["updated_at", "2018-10-23 19:08:01.914995"], ["id", 1]]