W5D3_reddit_clone/W5D3_redit_clone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Dogs"], ["description", "woof woof"], ["moderator", 1], ["created_at", "2018-10-23 20:49:17.829633"], ["updated_at", "2018-10-23 20:49:17.829633"]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_person = current_user

    if @sub.save

SELECT "subs".* FROM "subs"
---
  def index
    @subs = Sub.all

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @sub = Sub.find_by(id: params[:id])

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @sub = Sub.find_by(id: params[:id])

UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "RESPECT.chars.join(\".\")\r\n\r\nFind out what it means to mefsf"], ["updated_at", "2018-10-23 18:29:41.749550"], ["id", 1]]
---
  def update
    @sub = current_user.subs.find_by(id: params[:id])

    if @sub.update_attributes(sub_params)