W4D1_routing/first_routes/app/controllers/artworks_controller.rb

  def index
    @artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks"

  def show
    @artwork = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    @artwork = Artwork.new(artwork_params)
    if @artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "XD"], ["image_url", "somenieurl.com"], ["artist_id", 8], ["created_at", "2018-10-15 21:38:48.160092"], ["updated_at", "2018-10-15 21:38:48.160092"]]