W4D1_routing/first_routes/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "avi"], ["email", "avi@davi.com"], ["created_at", "2018-10-15 18:31:57.470913"], ["updated_at", "2018-10-15 18:31:57.470913"]]
---
  def create
    user = User.new(user_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "robinson!"], ["updated_at", "2018-10-15 18:51:32.663218"], ["id", 4]]
---
  def update
    user = User.find(params[:id])

    if user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
  def destroy
    user = User.find(params[:id])

    if user.destroy