W5D3_reddit_clone/W5D3_redit_clone/app/models/user.rb

  def self.find_by_credentials(u, pw)
    user = User.find_by(username: u)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "paul"], ["LIMIT", 1]]

  def reset_session_token
    self.session_token = generate_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "fUW2IcDCebu4kGrkvafBpg"], ["updated_at", "2018-10-23 17:49:25.657006"], ["id", 1]]