W5D3_reddit_clone/W5D3_redit_clone/app/views/posts/new.html.erb

SELECT "subs".* FROM "subs"
---

  <% Sub.all.each do |subreddit| %>